# DuctType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctType Class
Members See Also
---
A duct type element.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DuctType : MEPCurveType
```

Visual Basic
---
```text
Public Class DuctType _
	Inherits MEPCurveType
```

Visual C++
---
```text
public ref class DuctType : public MEPCurveType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..MEPCurveType Autodesk.Revit.DB.Mechanical..::..DuctType
# See Also
DuctType Members
Autodesk.Revit.DB.Mechanical Namespace